# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [3]:
query = """
        SELECT firstName, lastName
        FROM employees
        INNER JOIN offices
        USING(officeCode)
        WHERE city = 'Boston'
        """

df = pd.DataFrame(c.execute(query).fetchall())
df.columns = [x[0] for x in c.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [4]:
query = """
        SELECT COUNT(employeeNumber) as num_employees, officeCode
        FROM offices
        LEFT JOIN employees
        USING(officeCode)
        GROUP BY officeCode
        HAVING num_employees = 0;
        """
df = pd.DataFrame(c.execute(query).fetchall())
# df.columns = [x[0] for x in c.description]
df

Empty DataFrame
Columns: []
Index: []

## Write 3 Questions of your own and answer them

In [5]:
# Who is the top 5 customers by amount paid?number of orders and payments?

query = """
        SELECT c.contactLastName, c.contactFirstName, SUM(p.amount) as total_spent, COUNT(o.orderNumber) as total_orders
        FROM customers c
        JOIN payments p
        USING(customerNumber)
        JOIN orders o
        USING(customerNumber)
        GROUP BY c.contactLastName, c.contactFirstName
        ORDER BY total_spent DESC
        """
df = pd.DataFrame(c.execute(query).fetchmany(5))
df.columns = [x[0] for x in c.description]
df

  contactLastName contactFirstName  total_spent  total_orders
0          Freyre           Diego   18609213.48           338
1          Nelson            Susan   9931200.08           153
2        Ferguson            Peter    902925.35            20
3       Natividad             Eric    781255.15            20
4          Graham             Mike    773110.40            20

In [17]:
# Your code here
import pandas as pd
query = """
        SELECT  c.contactLastName, 
                c.contactFirstName, 
                SUM(od.quantityOrdered) AS num_ordered, 
                (od.quantityOrdered * od.priceEach) AS total_amount_ordered, 
                pl.productLine
        FROM customers c
        JOIN orders o
        USING(customerNumber)
        JOIN orderdetails od
        USING(orderNumber)
        JOIN products p
        USING(productCode)
        JOIN productlines pl
        USING(productLine)
        GROUP BY c.contactLastName, c.contactFirstName, pl.productLine
        ORDER BY total_amount_ordered
    
        """

df = pd.DataFrame(c.execute(query).fetchall())
df.columns = [x[0] for x in c.description]
df

,contactLastName,contactFirstName,num_ordered,total_amount_ordered,productLine
0,Huxley,Adrian,739,529.35,Vintage Cars
1,Frick,Sue,556,546.66,Vintage Cars
2,Lebihan,Laurence,156,557.60,Vintage Cars
3,Shimamura,Akiko,231,615.45,Vintage Cars
4,Taylor,Sue,64,653.52,Classic Cars
5,McRoy,Sarah,129,662.90,Classic Cars
6,Frick,Sue,450,834.20,Planes
7,King,Jean,318,848.54,Vintage Cars
8,Roel,José Pedro,70,856.80,Vintage Cars
9,O'Hara,Anna,220,870.96,Vintage Cars
10,Huang,Wing,69,937.20,Trains
11,Saveley,Mary,475,941.76,Vintage Cars
12,Donnermeyer,Michael,245,980.28,Planes
13,Labrune,Janine,225,986.42,Classic Cars
14,Franco,Valarie,80,1018.71,Vintage Cars
15,Freyre,Diego,1596,1046.50,Vintage Cars
16,Donnermeyer,Michael,101,1066.52,Vintage Cars
17,Clenahan,Sean,491,1076.94,Vintage Cars
18,Henriot,Paul,214,1084.89,Motorcycles
19,Da Silva,Daniel,205,1094.86,Vintage Cars
20,Huxley,Adrian,243,1096.41,Planes
21,Huxley,Adrian,162,1099.56,Trucks and Buses
22,Koskitalo,Pirkko,175,1105.00,Planes
23,Benitez,Violeta,131,1107.54,Vintage Cars
24,McRoy,Sarah,497,1132.50,Vintage Cars
25,Hernandez,Maria,21,1144.08,Trains
26,Klaeboe,Jan,122,1180.74,Vintage Cars
27,MacKinlay,Wales,77,1181.04,Trains
28,Leong,Kelvin,120,1186.00,Vintage Cars
29,Henriot,Paul,47,1186.25,Trains
...,...,...,...,...,...
398,Calaghan,Ben,91,5208.00,Trucks and Buses
399,Cartrain,Pascale,117,5239.40,Classic Cars
400,Ricotti,Franco,154,5239.68,Planes
401,Saavedra,Eduardo,110,5273.95,Motorcycles
402,Saavedra,Eduardo,45,5324.40,Classic Cars
403,Benitez,Violeta,157,5500.44,Motorcycles
404,King,Julie,104,5520.62,Planes
405,Benitez,Violeta,96,5576.50,Planes
406,Yoshido,Juri,140,5597.76,Classic Cars
407,Karttunen,Matti,328,5613.66,Classic Cars
408,Roel,José Pedro,196,5621.77,Classic Cars
409,Cartrain,Pascale,41,5624.79,Planes
410,Shimamura,Akiko,199,5721.60,Classic Cars
411,Clenahan,Sean,119,6050.03,Classic Cars
412,Klaeboe,Jan,369,6108.50,Classic Cars
413,Tseng,Jerry,29,6214.70,Classic Cars
414,Bertrand,Marie,48,6490.56,Vintage Cars
415,Young,Dorothy,671,6524.18,Classic Cars
416,King,Julie,417,6544.93,Classic Cars
417,Cruz,Arnold,478,6696.00,Classic Cars
418,Da Silva,Daniel,135,6788.76,Classic Cars
419,Salazar,Rosa,44,6806.80,Vintage Cars
420,Calaghan,Ben,117,7067.58,Classic Cars
421,Thompson,Steve,35,7200.55,Classic Cars
422,Fernandez,Jesus,91,7206.43,Classic Cars
423,Petersen,Jytte,574,7621.90,Classic Cars
424,Accorti,Paolo,149,7708.05,Classic Cars
425,Pipps,Georg,735,7863.80,Classic Cars
426,Nelson,Allen,382,7995.41,Classic Cars
427,Citeaux,Frédérique,602,9712.04,Classic Cars

In [7]:
# Your code here

In [9]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [26]:
query = """
        SELECT e.firstName || " " || e.lastName as customerName, p.productName
        FROM employees e
        INNER JOIN customers c
        ON e.employeeNumber = c.salesRepEmployeeNumber
        INNER JOIN orders o
        ON o.customerNumber = c.customerNumber
        INNER JOIN orderdetails od
        ON od.orderNumber = o.orderNumber
        INNER JOIN products p
        ON p.productCode = od.productCode
        """
df = pd.DataFrame(c.execute(query).fetchall())
df.columns = [x[0] for x in c.description]
df.set_index('customerName')
# df

                                                 productName
customerName
Leslie Jennings                               1958 Setra Bus
Leslie Jennings                       1940 Ford Pickup Truck
Leslie Jennings                      1939 Cadillac Limousine
Leslie Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
Leslie Jennings                            1968 Ford Mustang
Leslie Jennings                           1968 Dodge Charger
Leslie Jennings                      1970 Plymouth Hemi Cuda
Leslie Jennings                           1969 Dodge Charger
Leslie Jennings                  1948 Porsche 356-A Roadster
Leslie Jennings                         1969 Dodge Super Bee
Leslie Jennings                        1976 Ford Gran Torino
Leslie Jennings                             1957 Vespa GS150
Leslie Jennings                    1957 Corvette Convertible
Leslie Jennings                      1982 Ducati 900 Monster
Leslie Jennings                      1982 Lamborghini Diablo
Leslie Jennings                    1971 Alpine Renault 1600s
Leslie Jennings                      1956 Porsche 356A Coupe
Leslie Jennings                        1961 Chevrolet Impala
Leslie Jennings                            1982 Ducati 996 R
Leslie Jennings                    1974 Ducati 350 Mk3 Desmo
Leslie Jennings                           2002 Yamaha YZR M1
Leslie Jennings                            2001 Ferrari Enzo
Leslie Jennings                           1969 Corvair Monza
Leslie Jennings                             1969 Ford Falcon
Leslie Jennings                            1903 Ford Model A
Leslie Jennings                     Collectable Wooden Train
Leslie Jennings                        1970 Triumph Spitfire
Leslie Jennings                          1904 Buick Runabout
Leslie Jennings                        18th century schooner
Leslie Jennings             1912 Ford Model T Delivery Wagon
...                                                      ...
Martin Gerard                       1917 Grand Touring Sedan
Martin Gerard                             1911 Ford Town Car
Martin Gerard                      1932 Model A Ford J-Coupe
Martin Gerard                         1928 Mercedes-Benz SSK
Martin Gerard                    1939 Chevrolet Deluxe Coupe
Martin Gerard      1938 Cadillac V-16 Presidential Limousine
Martin Gerard               1936 Mercedes Benz 500k Roadster
Martin Gerard                              2001 Ferrari Enzo
Martin Gerard                             1969 Corvair Monza
Martin Gerard                        1939 Cadillac Limousine
Martin Gerard                       1962 Volkswagen Microbus
Martin Gerard                          1936 Chrysler Airflow
Martin Gerard                    1980’s GM Manhattan Express
Martin Gerard    1996 Peterbilt 379 Stake Bed with Outrigger
Martin Gerard                                1982 Camaro Z28
Martin Gerard                              1957 Chevy Pickup
Martin Gerard                 1998 Chrysler Plymouth Prowler
Martin Gerard                         1964 Mercedes Tour Bus
Martin Gerard                          1926 Ford Fire Engine
Martin Gerard                    1992 Ferrari 360 Spider red
Martin Gerard                             1970 Dodge Coronet
Martin Gerard                       1962 Volkswagen Microbus
Martin Gerard            1958 Chevy Corvette Limited Edition
Martin Gerard              1992 Porsche Cayenne Turbo Silver
Martin Gerard                    1980’s GM Manhattan Express
Martin Gerard                    1954 Greyhound Scenicruiser
Martin Gerard         1950's Chicago Surface Lines Streetcar
Martin Gerard               Diamond T620 Semi-Skirted Tanker
Martin Gerard                             1911 Ford Town Car
Martin Gerard               1936 Mercedes Benz 500k Roadster

[2996 rows x 1 columns]

## Level Up: Display the Number of Products each employee has sold

In [10]:
query = """
        SELECT e.firstName, e.lastName, sum(od.quantityOrdered) as num_products_sold
        FROM employees e
        INNER JOIN customers c
        ON e.employeeNumber = c.salesRepEmployeeNumber
        INNER JOIN orders o
        ON o.customerNumber = c.customerNumber
        INNER JOIN orderdetails od
        ON od.orderNumber = o.orderNumber
        INNER JOIN products p
        ON p.productCode = od.productCode
        GROUP BY e.firstName, e.lastName
        ORDER BY num_products_sold DESC
        """
df = pd.DataFrame(c.execute(query).fetchall())
df.columns = [x[0] for x in c.description]
df

   firstName   lastName  num_products_sold
0     Gerard  Hernandez              14231
1     Leslie   Jennings              11854
2     Pamela   Castillo               9290
3      Larry       Bott               8205
4      Barry      Jones               7486
5     George     Vanauf               7423
6      Peter      Marsh               6632
7       Andy     Fixter               6246
8       Loui     Bondur               6186
9      Steve  Patterson               5561
10  Foon Yue      Tseng               5016
11      Mami      Nishi               4923
12     Julie   Firrelli               4227
13    Martin     Gerard               4180
14    Leslie   Thompson               4056

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!